Catalogs/ОбъектыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыРасчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетовСПартнерами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияССамозанятым</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьОстаткиАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОбъектыРасчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	(Объект <> Неопределено
	|		И ЗначениеРазрешено(Объект)
	|	ИЛИ Объект = Неопределено
	|		И ЗначениеРазрешено(Организация)
	|		И ЗначениеРазрешено(Партнер)
	|	)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	(Объект <> Неопределено
	|		И ЗначениеРазрешено(Объект)
	|	ИЛИ Объект = Неопределено
	|		И ЗначениеРазрешено(Организация)
	|		И ЗначениеРазрешено(Партнер)
	|	)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Вызывается при замене дублей в реквизитах элементов.
//
// Параметры:
//  ПарыЗамен - Соответствие Из КлючИЗначение - содержит пары значений оригинал и дубль.
//  НеобработанныеЗначенияОригиналов - Массив из Структура:
//    * ЗаменяемоеЗначение - ЛюбаяСсылка - оригинальное значение заменяемого объекта.
//    * ИспользуемыеСвязи - см. ОбщегоНазначения.СвязиПодчиненныхОбъектовПоТипам
//    * ЗначениеКлючевыхРеквизитов - Структура - Ключ - имя реквизита, значение - значение реквизита.
//
Процедура ПриПоискеЗаменыСсылок(ПарыЗамен, НеобработанныеЗначенияОригиналов) Экспорт
	
	Для Каждого НеобработанныйДубль Из НеобработанныеЗначенияОригиналов Цикл
		ЗаменяемоеЗначение = НеобработанныйДубль.ЗаменяемоеЗначение;
		ЗначениеКлючевыхРеквизитов = НеобработанныйДубль.ЗначениеКлючевыхРеквизитов;
		
		Реквизиты = Новый Массив;
		Для Каждого Элемент Из ЗначениеКлючевыхРеквизитов Цикл
			Реквизиты.Добавить(Элемент.Ключ);
		КонецЦикла;
		ЗначенияРеквизитовДубля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаменяемоеЗначение, Реквизиты);
		
		РеквизитыДляПоиска = Новый Структура;
		РеквизитыДляСоздания = Новый Структура;
		Для Каждого КлючевойРеквизит Из ЗначениеКлючевыхРеквизитов Цикл
			ЗначениеОригинала = ПарыЗамен.Получить(КлючевойРеквизит.Значение);
			РеквизитыДляПоиска.Вставить(КлючевойРеквизит.Ключ, ?(ЗначениеОригинала = Неопределено, КлючевойРеквизит.Значение, ЗначениеОригинала));
			РеквизитыДляСоздания.Вставить(КлючевойРеквизит.Ключ, ЗначенияРеквизитовДубля[КлючевойРеквизит.Ключ]);
		КонецЦикла;
		
		// @skip-check query-in-loop - иначе невозможно понять существует такой ключ или нет
		ПарыЗамен.Вставить(ЗаменяемоеЗначение, СоздатьПоКлючу(РеквизитыДляПоиска, РеквизитыДляСоздания));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Объект");
	Поля.Добавить("Наименование");
	Поля.Добавить("ТипСсылки");
	Поля.Добавить("ТипРасчетов");
	Поля.Добавить("ТипОбъектаРасчетов");
	Поля.Добавить("НаименованиеПервичногоДокумента");
	Поля.Добавить("НомерВходящегоДокумента");
	Поля.Добавить("ДатаВходящегоДокумента");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Данные.Объект) И ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Представление = НСтр("ru = '<Пустой>'");
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Данные.ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком")
		И Данные.ТипОбъектаРасчетов = ПредопределенноеЗначение("Перечисление.ТипыОбъектовРасчетов.Накладная") Тогда
		
		Данные.Вставить("НаименованиеВходящегоДокумента", Данные.НаименованиеПервичногоДокумента);
		ОбщегоНазначенияУТКлиентСервер.ОбработкаПолученияПредставленияВходящегоДокумента(
		Данные, Представление, СтандартнаяОбработка, Данные.ТипСсылки);
		
	Иначе
		Представление = Данные.Наименование;   
		СтандартнаяОбработка = Ложь;
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Если НЕ МультиязычностьПовтИсп.КонфигурацияИспользуетТолькоОдинЯзык(Ложь) Тогда
			
			Если ЗначениеЗаполнено(Данные.Объект) И Данные.ТипОбъектаРасчетов <> ПредопределенноеЗначение("Перечисление.ТипыОбъектовРасчетов.Договор") Тогда
				Представление = ОбщегоНазначенияУТКлиентСервер.СтандартноеПредставлениеДокумента(Данные.ТипСсылки, Данные.Номер, Данные.Дата);
			КонецЕсли;
			
		КонецЕсли;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			РежимОтлажки = ОбщегоНазначения.РежимОтладки();
		#Иначе
			РежимОтлажки = ОбщегоНазначенияКлиент.РежимОтладки();
		#КонецЕсли
		
		Если НЕ РежимОтлажки Тогда
			Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
				Результат= ВзаиморасчетыВызовСервера.ФормаОбъектаРасчетов(Параметры.Ключ);
				Если Результат.Форма <> "" Тогда
					СтандартнаяОбработка = Ложь;
					ВыбраннаяФорма = Результат.Форма;
					Параметры.Ключ = Результат.Ключ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Служебный", Ложь);
	
	Параметры.Вставить("Отбор", Отбор);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ОбъектыРасчетов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.25.39";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("51119c20-5762-5c1b-bdf7-2f9a8da27bec");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.ОбъектыРасчетов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Обновление справочника ""Объекты расчетов"":'"));
	СписокОписаний.Добавить(НСтр("ru = '- Заполнение признака ""Регистры взаиморасчетов делятся по направлениям деятельности""';"));
	
	Обработчик.Комментарий = СтрСоединить(СписокОписаний, Символы.ПС);
	// Влияет на проведение по взаиморасчетам
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Критичный;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.ОбъектыРасчетов.ПолноеИмя());
	// РегистрыНакопления.РасчетыСКлиентами, РегистрыНакопления.РасчетыСПоставщиками - допускается грязное чтение
	// Для текущего обработчика не требуется предварительного выполнения обработчиков обновления регистров расчетов
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.ОбъектыРасчетов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.ОбъектыРасчетов.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Справочник.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК Справочник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК ЗаписиРегистраСНД
	|			ПО ЗаписиРегистраСНД.ОбъектРасчетов = Справочник.Ссылка
	|				И ЗаписиРегистраСНД.АналитикаУчетаПоПартнерам.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|ГДЕ
	|	Справочник.РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности <> (ЗаписиРегистраСНД.ОбъектРасчетов ЕСТЬ NULL)
	|	И Справочник.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Справочник.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК Справочник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК ЗаписиРегистраСНД
	|			ПО ЗаписиРегистраСНД.ОбъектРасчетов = Справочник.Ссылка
	|				И ЗаписиРегистраСНД.АналитикаУчетаПоПартнерам.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|ГДЕ
	|	Справочник.РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности <> (ЗаписиРегистраСНД.ОбъектРасчетов ЕСТЬ NULL)
	|	И Справочник.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Справочник.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК Справочник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаправленияДеятельности КАК Направление
	|			ПО Направление.Ссылка = Справочник.НаправлениеДеятельности
	|ГДЕ
	|	НЕ Направление.УчетДоходов И Справочник.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|	ИЛИ НЕ Направление.УчетРасчетовСПоставщиками И Справочник.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|	
	|";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов"));
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляОбновления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаЭлементов
		|ИЗ
		|	&ДанныеДляОбновления КАК ДанныеДляОбновления
		|ИНДЕКСИРОВАТЬ ПО Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ВложенныйЗапрос.ЕстьЗаписиСНД) КАК ЕстьЗаписиСНД
		|ИЗ (
		|	ВЫБРАТЬ
		|		ТаблицаЭлементов.Ссылка КАК Ссылка,
		|		ЕСТЬNULL(РасчетыСКлиентами.АналитикаУчетаПоПартнерам.НаправлениеДеятельности,ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				 <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК ЕстьЗаписиСНД
		|	ИЗ
		|		ТаблицаЭлементов КАК ТаблицаЭлементов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|				ПО ТаблицаЭлементов.Ссылка = РасчетыСКлиентами.ОбъектРасчетов
		|	ГДЕ
		|		РасчетыСКлиентами.ОбъектРасчетов В (ВЫБРАТЬ Ссылка ИЗ ТаблицаЭлементов)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаЭлементов.Ссылка КАК Ссылка,
		|		ЕСТЬNULL(РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.НаправлениеДеятельности,ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				 <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК ЕстьЗаписиСНД
		|	ИЗ
		|		ТаблицаЭлементов КАК ТаблицаЭлементов
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
		|				ПО ТаблицаЭлементов.Ссылка = РасчетыСПоставщиками.ОбъектРасчетов) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка 
		|";
	
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	
	Справочник = Запрос.Выполнить().Выбрать();
	
	Пока Справочник.Следующий() Цикл
		
		ПричинаИсключения = "";
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Справочник.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			СправочникОбъект = Справочник.Ссылка.ПолучитьОбъект(); // СправочникОбъект
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Проверьте данные справочника вручную.'");
			
			Если СправочникОбъект <> Неопределено Тогда
				
				// Заполнение РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности
				Если СправочникОбъект.РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности <> (НЕ Справочник.ЕстьЗаписиСНД) Тогда
					СправочникОбъект.РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности = НЕ Справочник.ЕстьЗаписиСНД;
				КонецЕсли;
				
				// Очистка неправильных НД
				Если ЗначениеЗаполнено(СправочникОбъект.НаправлениеДеятельности) Тогда
					ЗначенияРеквизитовНД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СправочникОбъект.НаправлениеДеятельности, "УчетДоходов,УчетРасчетовСПоставщиками");
					Если СправочникОбъект.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом И НЕ ЗначенияРеквизитовНД.УчетДоходов
						ИЛИ СправочникОбъект.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком И НЕ ЗначенияРеквизитовНД.УчетРасчетовСПоставщиками Тогда
							СправочникОбъект.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ПричинаИсключения = "Запись";
			
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Справочник.Ссылка);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Справочник.Ссылка);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					Справочник.Ссылка, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(НСтр("ru = 'Не удалось обработать элемент справочника ""Объекты расчетов"".'"), Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано > 0 Тогда
		ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

// Список реквизитов, по которым определяется уникальность элемента справочника 
// см. ОбъектыРасчетовСервер.ПроверитьСоздатьОбъектРасчетов, параметр РеквизитыОбъекта.
// 
// Возвращаемое значение:
//   Строка
//
Функция КлючевыеРеквизиты() Экспорт
	
	ПоляСвязей = "Объект, Организация, Контрагент, Партнер, ТипРасчетов, ВалютаВзаиморасчетов, Договор";
	Возврат ПоляСвязей;
	
КонецФункции

// Создает новый объект расчетов по ключевым полям или возвращает существующий.
//
// Параметры:
//  ПараметрыПоиска - Структура из КлючИЗначение:
//   * Ключ     - Строка - имя реквизита. См. КлючевыеРеквизиты.
//   * Значение - Произвольный - значение реквизита.
//  ПараметрыСоздания - Структура из КлючИЗначение:
//   * Ключ     - Строка - имя реквизита. См. КлючевыеРеквизиты.
//   * Значение - Произвольный - значение реквизита.
//
// Возвращаемое значение:
//   СправочникСсылка.ОбъектыРасчетов
//
Функция СоздатьПоКлючу(ПараметрыПоиска, ПараметрыСоздания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &Объект
	|	И ОбъектыРасчетов.Организация = &Организация
	|	И ОбъектыРасчетов.Контрагент = &Контрагент
	|	И ОбъектыРасчетов.Партнер = &Партнер
	|	И ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов
	|	И ОбъектыРасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	|	И ОбъектыРасчетов.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &ОбъектЗаполнение
	|	И ОбъектыРасчетов.Организация = &ОрганизацияЗаполнение
	|	И ОбъектыРасчетов.Контрагент = &КонтрагентЗаполнение
	|	И ОбъектыРасчетов.Партнер = &ПартнерЗаполнение
	|	И ОбъектыРасчетов.ТипРасчетов = &ТипРасчетовЗаполнение
	|	И ОбъектыРасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетовЗаполнение
	|	И ОбъектыРасчетов.Договор = &ДоговорЗаполнение";
	
	Запрос.УстановитьПараметр("Объект", ПараметрыПоиска.Объект);
	Запрос.УстановитьПараметр("Организация", ПараметрыПоиска.Организация);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыПоиска.Контрагент);
	Запрос.УстановитьПараметр("Партнер", ПараметрыПоиска.Партнер);
	Запрос.УстановитьПараметр("ТипРасчетов", ПараметрыПоиска.ТипРасчетов);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ПараметрыПоиска.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("Договор", ПараметрыПоиска.Договор);
	
	Запрос.УстановитьПараметр("ОбъектЗаполнение", ПараметрыСоздания.Объект);
	Запрос.УстановитьПараметр("ОрганизацияЗаполнение", ПараметрыСоздания.Организация);
	Запрос.УстановитьПараметр("КонтрагентЗаполнение", ПараметрыСоздания.Контрагент);
	Запрос.УстановитьПараметр("ПартнерЗаполнение", ПараметрыСоздания.Партнер);
	Запрос.УстановитьПараметр("ТипРасчетовЗаполнение", ПараметрыСоздания.ТипРасчетов);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетовЗаполнение", ПараметрыСоздания.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("ДоговорЗаполнение", ПараметрыСоздания.Договор);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[0].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка.Следующий();
		Ключ = Справочники.ОбъектыРасчетов.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Ключ, Выборка);
		ЗаполнитьЗначенияСвойств(Ключ, ПараметрыПоиска);
		
		ВыборкаДополнительныеРеквизиты = Выборка.ДополнительныеРеквизиты; // РезультатЗапроса -
		ДополнительныеРеквизиты = ВыборкаДополнительныеРеквизиты.Выбрать(); 
		Пока ДополнительныеРеквизиты.Следующий() Цикл
			НоваяСтрока = Ключ.ДополнительныеРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеРеквизиты);
		КонецЦикла;
		
		Ключ.Записать();
	Иначе
		Ключ = РезультатЗапроса[0].Выбрать();
		Ключ.Следующий();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ключ.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
